
export const CONTENT = {
  title: 'JitAi 技术体系特性',
  remark:`开创性的解释型应用协议（JAAP）和应用运行平台，使得应用系统及其模块成为可被AI动态感知、动态加载、实时编排、精确调度的解释型系统---完美的AI智能体的工作环境，把传统应用及生态带入AI驱动和实时编排时代。<br/>
基于矩阵型元架构的高集成度编排式编程框架，让业务层应用以实体编排为主，复杂度和工程量降低90%。图形化编排和编程的开发工具和开发方式，使开发迭代速度提升10倍，让开发者从容应对AI应用的复杂多变。<br/>
自动化运维工具，让构建、发布、部署和更新也大为简化。<br/>`,
  cards: [
    {
      title: '支持企业级AI应用',
      subtitle: '软件与智件原生一体',
      icon: '🏢',
      sections: `
      软件：即传统企业管理软件，广泛涉及企业业务流程的各个专业环节岗位，“记录事务”，跨部门协同和流转，提升企业整体运转效率。<br/>
      智件：即AI智能体、AI助理，深入到业务流程中的某个专业岗位，利用系统中的业务数据、系统模块，“执行事务”，辅助特定岗位提升生产力。<br/>
      JitAi支持智件与软件原生一体，让AI化的企业级应用快速落地。
      `
    },
    {
      title: '支持生产级AI应用',
      subtitle: 'AI与UI紧密协作',
      icon: '⚙️',
      sections: `
      当前的AI大模型存在幻觉和智力局限，而生产级AI应用强调安全合规、精确可控，且需要AI和人类通过UI紧密协作共同完成特定任务。JitAi通过精细化权限框架、AI工作流程框架、AI-UI交互框架，快速迭代开发符合生产级要求的AI应用功能。<br/>
      `
    },
    {
      title: '全栈AI上下文工程架构',
      subtitle: '动态感知、实时编排、精准调度',
      icon: '🎨',
      sections: `
      AI应用开发已经不是简单的提示词工程，AI上下文工程概念应运而生。
JitAi解释型架构作为全球首个全栈全系统AI上下文工程架构，让全栈全系统模块自描述、可动态加载（热插拔）、可扩展、可替换、可编排，让应用系统成为可被AI动态感知、实时编排、精准驱动的AI智能体工作环境。得益于解释型架构的动态性和可编排性，JitAi图形化编排和编程工具轻松实现AI应用的图形化编排和编程能力。
      `
    },
    {
      title: '应用层技术精简革命',
      subtitle: '编排式编程框架，让应用开发以实体编排为主、过程逻辑编程为辅',
      icon: '🎨',
      sections: `
      基于矩阵型架构模型和巨型模块封装技术的JitAi编排式编程框架，高度封装集成各类技术模块，开放业务实体定义和实现，使得业务应用层只需定义业务实体和实现少量过程逻辑，极大降低应用层技术复杂度（代码量降低90%），带来应用系统设计和开发的效率革命。
      `
    },
    {
      title: '图形化编排与编程',
      subtitle: '应用开发全新范式',
      icon: '🚀',
      sections: `
      面向编排为主和编程为辅的应用系统开发，JitAi提供图形化编排和图形化编程双模一体的开发工具，同时支持原生编码。<br/>
      可视化编排工具，可以生成高度结构化的实例元素的声明式代码。<br/>
      可视化编程工具，可以生成实例元素中的过程的命令式代码。<br/>
      通过简单易懂、高质量、高效率的可视化编排和可视化编程，可以开发业务应用的绝大部分功能，极大简化业务应用开发。
      区别传统的零代码和低代码平台，JitAi图形化编排和编程工具是基于应用协议和编程框架的代码编辑技术，与程序员编码和AI编码共同编辑同一份源代码，工具不对程序员编码造成任何限制。
`
    },
    {
      title: '极简部署与更新',
      subtitle: '一键部署、自动更新',
      icon: '🔄',
      sections: `
      JitAi支持应用平台自身以及应用系统的自动化部署与更新，服务器端可像浏览器端一样按需加载应用，极大简化私有化部署环境下的运维。<br/>
      同时，JitAi还支持一键分布式集群部署，横向扩展计算节点，轻松应对高并发密集计算的扩展需求。`
    },
    {
      title: '无缝集成',
      subtitle: '极简集成和被集成',
      icon: '🔗',
      sections: `
      JitAi具备强大的集成能力，可自动生成调用外部API的服务元素，轻松集成任意接口。<br/>
      天然支持微服务，可以便利地把任何元素化的模块封装到对外API中，供外部集成使用。<br/>
      `
    },
    {
      title: '无限扩展',
      subtitle: '极致关注点分离的多层架构，各层充分正交、无限扩展',
      icon: '📦',
      sections: `
      JitAi技术体系是极致关注点分离的多层架构技术体系，各层充分正交、无限扩展。
JitAi应用运行平台是高度开放的微内核运行平台，封装了设备基础设施和物理集群环境的虚拟化、前后端网络通信协同、应用加载和应用管理等基础能力。平台基于开放而精简的JAAP协议与应用系统协作，解释运行应用系统，但不实现任何应用层业务功能。<br/>
      基于JAAP协议的JitAi开发框架层，高度封装和集成应用层常见技术模块和框架，以应用继承方式被业务层复用、扩展、改写。<br/>
基于JAAP协议和JitAi开发框架的JitAi业务应用层，可以无限按需实现自身业务功能，还能无限扩展和改写JitAi开发框架的一切能力。
      同时，基于JitAi应用协议，开发者可以开发应用供其他开发者继承式复用、扩展、改写。`
    },
  ]
};